Revit 2026 API

# FamilyManagerReorderParameters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ReorderParameters(
	IList<FamilyParameter> parameters
)
```
```vb
Public Sub ReorderParameters (
	parameters As IList(Of FamilyParameter)
)
```
```cpp
public:
void ReorderParameters(
	IList<FamilyParameter^>^ parameters
)
```
```fsharp
member ReorderParameters :
        parameters : IList<FamilyParameter> -> unit
```

#### Parameters

parameters IListFamilyParameter

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace